author("Небо і площі", "Андрухович Юрій Ігорович").
author("Середмістя", "Андрухович Юрій Ігорович").
author("Екзотичні птахи і рослини", "Андрухович Юрій Ігорович").
author("Екзотичні птахи і рослини з додатком „Індія“: Колекція віршів", "Андрухович Юрій Ігорович").
author("Пісні для мертвого півня", "Андрухович Юрій Ігорович").
author("Листи в Україну", "Андрухович Юрій Ігорович").
author("Зліва, де серце", "Андрухович Юрій Ігорович").
author("Прапор", "Андрухович Юрій Ігорович").
author("Трициліндровий двигун любові", "Андрухович Юрій Ігорович").
author("Письменники про футбол", "Андрухович Юрій Ігорович").
author("Лексикон інтимних міст", "Андрухович Юрій Ігорович").
author("Рекреації", "Андрухович Юрій Ігорович").
author("Московіада", "Андрухович Юрій Ігорович").
author("Перверзія", "Андрухович Юрій Ігорович").
author("Дванадцять обручів", "Андрухович Юрій Ігорович").
author("Таємниця", "Андрухович Юрій Ігорович").
author("Коханці Юстиції", "Андрухович Юрій Ігорович").
author("Радіо Ніч", "Андрухович Юрій Ігорович").
author("Дезорієнтація на місцевості", "Андрухович Юрій Ігорович").
author("Моя Європа", "Андрухович Юрій Ігорович").
author("Диявол ховається в сирі", "Андрухович Юрій Ігорович").
author("Тут похований Фантомас", "Андрухович Юрій Ігорович").
author("Мої нездійснені мрії: книжечка-розмальовочка", "Полежака Артем Якович").
author("Стіхи о жизні: поезії", "Полежака Артем Якович").
author("Навісні пісні: поезії ", "Полежака Артем Якович").
author("Щоденник Україножера", "Семесюк Іван Леонідович").
author("Еволюція або смерть. Пригоди павіана Томаса", "Семесюк Іван Леонідович").
author("Фаршрутка", "Семесюк Іван Леонідович").
author("Серце апачі", "Семесюк Іван Леонідович").

fan("Антон Пархоменко", "Андрухович Юрій Ігорович").
fan("Богдан Горовий", "Полежака Артем Якович").
fan("Єлізавета Косарєва", "Полежака Артем Якович").
fan("Аліна Бородавка", "Семесюк Іван Леонідович").

recommendBook(Z) :-
	fan(Z, Y),
	author(X, Y),
    string_concat("Автор: ", Y, A),
    write(A), nl,
    write("Кгига: "), write(X).